<?php

function translit($str) { 
$converter = [
          "а"=>"a",  "б"=>"b", "в"=>"v",
		  "г"=>"g",  "д"=>"d", "е"=>"e",
          "ё"=>"yo", "ж"=>"zh", "з"=>"z",
		  "и"=>"i", "й"=>"j", "к"=>"k",
		  "л"=>"l", "м"=>"m", "н"=>"n",
		  "о"=>"o",  "п"=>"p", "р"=>"r",
		  "с"=>"s", "т"=>"t", "у"=>"u",
		  "ф"=>"f", "х"=>"h", "ц"=>"c",
		  "ч"=>"ch", "ш"=>"sh", "щ"=>"sch",
		  "ъ"=>"\'", "ы"=>"y", "ь"=>"'",
		  "э"=>"ye", "ю"=>"yu", "я"=>"ya"];
		  
	 $str = strtr($str, $converter);
	 return $str;
 };
echo translit("Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания");

?>